[
    {
        "year": 2023,
        "posts": [
            {
                "id": "s9utj8mp53-i70d6xpm01-8xojuwo73f",
                "date": "August 22, 2023",
                "title": "Knee Trouble",
                "author": "Chris",
                "content": "Well, we should be on a flight to Munich right now, but I managed to twist my knee up pretty bad last week and it hasn't made enough of a recovery to warrant walking 350 miles through the Alps.\r\n\r\nThus, we will not be hiking Der Traumpfad this year.\r\n\r\nThat's okay, there's always next year. And considering the condition of my knee, it's likely better to do a smaller trip as a test run after I finish my PT. To this end, we're looking into the Tour du Mont Blanc. The TMB still has some solid ascents and descents, but is one third (110 miles) of Der Traumpfad. So it should be a good introduction to trekking in the Alps.\r\n\r\n- Chris"
            },
            {
                "id": "6ia96kemmb-0mt8p169wk-kvnfztkugb",
                "date": "July 29, 2023",
                "title": "Blog Upgrade: Image Support",
                "author": "Chris",
                "content": "The blog now has support for images to be embedded in posts. And just in time too!\r\n\r\nHere's an example:\r\n\r\n<img width=\"350px\" src=\"https://krisairdancer.com/blog-content/images/marmolada_sella_ronda_grb.jpg\">\r\n<span class=\"caption\">Us at The Marmolada, Italy. (2019)</span>\r\n\r\nSpeaking of just in time. We'll be visiting The Marmolada - mountain in the background - again while hiking Der Traumpfad. In fact, we'll be hiking down to the lake, Lago di Fedaia, in this picture. It's been a minute since we visited to ride <a href=\"https://goldenramenbowl.com/sella-ronda-2019/\">The Sella Ronda</a> and do some Via Ferratas in 2019, so it'll be exciting to go back.\r\n\r\n- Chris"
            },
            {
                "id": "k4nqss0oi6-b5x2mge75x-740j2mj5ig",
                "date": "June 17, 2023",
                "title": "Welcome to my blog!",
                "author": "Chris",
                "content": "Welcome to my blog! Please excuse any bugs. I'm still working those out!\n\nMy intent for this part of the site is to be able to blog from Europe while Vista and I hike <a href=\"http://www.johnhayeswalks.com/2014/09/munich-to-venice-dream-way-review.html\">Der Traumpfad</a>. But I'm still a bit skeptical that this will work. Guess we'll just have to see how it goes.\n\nOh! I should also mention, there won't be any images in the posts on this blog yet. I haven't had the time to get that part setup yet. But I'll hopefully have that ready by the time we leave for the trip.\n\n- Chris"
            }
        ]
    }
]