[{"year":2023,"posts":[{"id":"fzfvfwoer2-xglo1dobvq-itstix4aff","date":"October 10, 2023","title":"Day 4: Move-in Day","author":"Chris","content":"Today we left the sketchy Comfort Inn - I failed to mention this yesterday, but it was a bit sketch - and made our way to a little pastry shop near the new apartment where we got a very expensive breakfast.\r\n\r\n<img width=\"250px\" src=\"https://krisairdancer.com/blog-content/images/detroit-move-2023-breakfast-1.jpg\">\r\n<span class=\"caption\">A very expensive breakfast.</span>\r\n\r\nWe hung out here for a few hours while I worked on my graphics assignment a bit - I didn't make much progress...\r\n\r\nAround 11AM, we got a call from the apartment saying that we could move in at 11:30, so we packed up and off we went.\r\n\r\nMoving in was relatively painless since we only had a small car's worth of stuff with us and the apartment isn't very big. But it does seem to be one of the nicer apartments in the city and has some great amenities, such as an enclosed courtyard, gym, and pool. The staff are also quite friendly, which is a big plus.\r\n\r\nThe AT&T guy stopped by to setup the internet at around the time we were finishing up. By the time he left, it was 2:30-3PM, but we still had more work to do.\r\n\r\n<img width=\"250px\" src=\"https://krisairdancer.com/blog-content/images/detroit-move-2023-apt-1.jpg\">\r\n<span class=\"caption\">Bathroom (human for scale)</span>\r\n\r\n<img width=\"250px\" src=\"https://krisairdancer.com/blog-content/images/detroit-move-2023-apt-2.jpg\">\r\n<span class=\"caption\">Closet (human for scale)</span>\r\n\r\n<img width=\"250px\" src=\"https://krisairdancer.com/blog-content/images/detroit-move-2023-apt-3.jpg\">\r\n<span class=\"caption\">Laundry (human for scale)</span>\r\n\r\n<img width=\"250px\" src=\"https://krisairdancer.com/blog-content/images/detroit-move-2023-apt-4.jpg\">\r\n<span class=\"caption\">Kitchen (human for scale)</span>\r\n\r\nIn an effort to move as few things across the country as possible, we didn't have any of the basics, like toilet paper or soap, so off to the store we went.\r\n\r\nShopping took a while, in part because the Walmart we went to was all the way out in Dearborn, which is a 20 minute drive away, but also because we had a lot to get.\r\n\r\nAside from the standard household supplies, we needed a little bit of furnature, including a bed, that we had to sort out. We quickly decided to keep things simple since we'll be moving out of the apartment and into a house next year. No need to buy a bunch of furnature that we'll just have to move anyway.\r\n\r\nWe picked up a desk, a lamp, and some storage cubbies, but are most proud of our bed: an air matress! Yep, we're opting for a year on an air mattress. The whole setup, sheets and all, came in under $80. Way less than a standard bed costs. It also means that we'll be able to easily move it out of the way to make room in our studio apartment.\r\n\r\nAnd that pretty much catches us up. We drove the lot home and hauled it up the elevator from the parking garrage, which was just as entertaining as it was tiring.\r\n\r\nFor dinner: Bologna sandwiches."},{"id":"77zgdzy5lm-zebpdkq00v-xfgqtlycg1","date":"October 9, 2023","title":"Day 3: Omaha to Detroit","author":"Chris","content":"So about Chicago...\r\n\r\nAs the name indicates, we decided not to stop in Chicago.\r\n\r\nAfter driving for a few hours, we did the math and realized that we could get to Detroit around 7PM, which would save us a day of driving. So we booked a hotel in Detroit and kept on driving straight past Chicago.\r\n\r\nMeanwhile, we forgot that we'd be passing through several other states. Sorry Iowa, we forgot that you exist.\r\n\r\nWe were surprised to find that Iowa looked much different than Nebraska. It certainly had corn, but it also had far more trees than Nebraska. We soon found out that this was due to the Mississipi River, which borders the state on the East side.\r\n\r\n<img width=\"250px\" src=\"https://krisairdancer.com/blog-content/images/detroit-move-2023-mississippi-river-1.jpg\">\r\n<span class=\"caption\">The Mississipi River is massive!</span>\r\n\r\n<img width=\"250px\" src=\"https://krisairdancer.com/blog-content/images/detroit-move-2023-iowa-corn-1.jpg\">\r\n<span class=\"caption\">Iowa corn!</span>\r\n\r\nAfter passing through Iowa, we drove through Illinois where despite not stopping in Chicago as originally planned, we were able to see the Chicago skyline from a bit of a distance. Plus, to our surprise, we even got to drive through the Northwest corner of Indiana! I wouldn't call it much of a visit though, considering we were only in the state for 30 minutes or so.\r\n\r\nNone of this driving was very eventful, but I did manage to get a lot done in the car. First thing in the morning, I managed to delete the day 1 post for this drive and had to write it all over again from scratch along with the day 2 post.\r\n\r\nI thought I had a \"double check\" on the delete button on my website, but it looks like I don't. One click and it's gone. Looks like I'll have to fix that.\r\n\r\nI also managed to get the first draft of the intro section to our design doc for capstone written. Naturally, as anything written in the car goes, it isn't very good, so I'll have to give it another go later on.\r\n\r\nOkay, that's enough of a digression. Michigan was a much needed respite from the corn that dominated our drive up to this point. The landscape here turned to trees and lush greenery. And although the leaves hadn't yet changed colors, it was quite beautiful.\r\n\r\nOh and I should mention, there was still plenty of corn.\r\n\r\n<img width=\"250px\" src=\"https://krisairdancer.com/blog-content/images/detroit-move-2023-michigan-corn-1.jpg\">\r\n<span class=\"caption\">Michigan corn!</span>\r\n\r\nWe arrived in Detroit around 7:30, drove to our hotel, and turned in for the night (after writing this post of course).\r\n\r\nTomorrow: Move in day!\r\n"},{"id":"w1fsk64lym-7xt3xk5ppn-h1qsah9jwo","date":"October 9, 2023","title":"Day 2: Cheyenne to Omaha","author":"Chris","content":"Day 2: Cheyanne to Omaha\r\n\r\nToday, we drove through nearly all of Nebraska.\r\n\r\nThe morning started with us driving into the searing Nebraska sun. It seems to be much more intense in Wyoming and Nebraska than anywhere we've driven before. To add to the misery, Vista discovered that the hotel coffee she had gotten tasted like sugar water instead of coffee and we started looking for a place to stop for a replacement. A hundred miles outside of Cheyanne, we discovered a Starbucks and Vista's coffee was restored.\r\n\r\nAlong the way, I managed to write out the Day 1 blog post on my phone, which proved to be much easier than I thought. It would appear that I've finally managed to build something that works well and is usable.\r\n\r\nAs for the rest of the drive, it was uneventful. The stretch of Nebraska we drove through contained nothing but corn fields and small towns. So without further adue, an obligatory corn field photo.\r\n\r\n<img width=\"250px\" src=\"https://krisairdancer.com/blog-content/images/detroit-move-2023-corn-1.jpg\">\r\n<span class=\"caption\">TODO</span>\r\n\r\nToday's stretch was the longest one of the trip and we didn't arrive in Omaha until around 3PM. This gave me about an hour to work on graphics before dinner.\r\n\r\nDinner ended up being a meal from the hotel restaurant. It wasn't bad, but greasy fried chicken fingers and a chicken burger weren't exactly what we were hoping for. But considering the low amoung of effort we had to put forth to find a place to eat, we can't complain too much.\r\n\r\nAfter dinner, more UK trip planning and an early bed - we'll likely be feeling the time change in the morning.\r\n\r\nTomorrow: Chicago."},{"id":"ucqv5mahyg-wjl319vt5n-chbu84yx58","date":"October 9, 2023","title":"Day 1: SLC to Cheyenne","author":"Chris","content":"Day 1: SLC to Cyeanne\r\n\r\nToday begins the first of two cross country drives to move us to Detroit, Michigan.\r\n\r\nWe started our day with a drive through the autumn leaves of the Wasatch range before plunging into the flatlands of Wyoming.\r\n\r\nOn our way through Park city, we were treated to a \"fog lake.\"\r\n\r\n<img width=\"250px\" src=\"https://krisairdancer.com/blog-content/images/detroit-move-2023-fog.jpg\">\r\n<span class=\"caption\">A \"fog lake\" just outside of Park City.</span>\r\n\r\nAfter this, there was basically nothing of interest to report and fortunately or unfortunately, depending on how you look at it, we got to Cheyanne by about 1PM.\r\n\r\nThe way the lodging is distributed means that we were forced to do the trip in either two really long days (arrive at each stop around midnight) or into four half days.\r\n\r\nWe chose the four half days so we could avoid driving tired on the second days. Something that seemed a bit foolish considering the length of the drive.\r\n\r\nIn Cheyanne, we found a place to grab lunch - Taco John's - and then checked into the hotel.\r\n\r\nArriving early did provide me with the benefit of being able to get started on my graphics assignment, which with any luck, will be done by the end of Fall Break (a week from Monday).\r\n\r\nAfter working for an hour or so, we went looking for something other than the down home hearty food that dominates the quisine in Wyoming and managed to find a pretty good ramen shop in the dying Cheyanne mall.\r\n\r\nAfter this, we did a bit of planning for the next adventure - the UK - and turned in for the night.\r\n\r\nTomorrow: Omaha."},{"id":"s9utj8mp53-i70d6xpm01-8xojuwo73f","date":"August 22, 2023","title":"Knee Trouble","author":"Chris","content":"Well, we should be on a flight to Munich right now, but I managed to twist my knee up pretty bad last week and it hasn't made enough of a recovery to warrant walking 350 miles through the Alps.\r\n\r\nThus, we will not be hiking Der Traumpfad this year.\r\n\r\nThat's okay, there's always next year. And considering the condition of my knee, it's likely better to do a smaller trip as a test run after I finish my PT. To this end, we're looking into the Tour du Mont Blanc. The TMB still has some solid ascents and descents, but is one third (110 miles) of Der Traumpfad. So it should be a good introduction to trekking in the Alps.\r\n\r\n- Chris"},{"id":"6ia96kemmb-0mt8p169wk-kvnfztkugb","date":"July 29, 2023","title":"Blog Upgrade: Image Support","author":"Chris","content":"The blog now has support for images to be embedded in posts. And just in time too!\r\n\r\nHere's an example:\r\n\r\n<img width=\"250px\" src=\"https://krisairdancer.com/blog-content/images/marmolada_sella_ronda_grb.jpg\">\r\n<span class=\"caption\">Us at The Marmolada, Italy. (2019)</span>\r\n\r\nSpeaking of just in time. We'll be visiting The Marmolada - mountain in the background - again while hiking Der Traumpfad. In fact, we'll be hiking down to the lake, Lago di Fedaia, in this picture. It's been a minute since we visited to ride <a href=\"https://goldenramenbowl.com/sella-ronda-2019/\">The Sella Ronda</a> and do some Via Ferratas in 2019, so it'll be exciting to go back.\r\n\r\n- Chris"},{"id":"k4nqss0oi6-b5x2mge75x-740j2mj5ig","date":"June 17, 2023","title":"Welcome to my blog!","author":"Chris","content":"Welcome to my blog! Please excuse any bugs. I'm still working those out!\n\nMy intent for this part of the site is to be able to blog from Europe while Vista and I hike <a href=\"http://www.johnhayeswalks.com/2014/09/munich-to-venice-dream-way-review.html\">Der Traumpfad</a>. But I'm still a bit skeptical that this will work. Guess we'll just have to see how it goes.\n\nOh! I should also mention, there won't be any images in the posts on this blog yet. I haven't had the time to get that part setup yet. But I'll hopefully have that ready by the time we leave for the trip.\n\n- Chris"}]}]